book/go语言编程.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>go语言编程.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/book/git%e6%95%99%e7%a8%8b.org.html">Prev: git教程.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/book">Up: book</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/book/javascript%e5%85%a8%e6%a0%88%e6%95%99%e7%a8%8b.org.html">Next: javascript全栈教程.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="概述">概述</h1>
<p>Go 编程思想核心是维持语言的简洁，时刻警惕特性复杂化，与 C 语言相通。</p>
<h2 id="简化">简化</h2>
<p>语言设计总体上持保守态度，有以下简化：</p>
<ol class="incremental">
<li>反对函数和操作符重载（overload），因其有负担而无解决问题的能力</li>
<li>反对继承、反对虚函数和虚函数重载</li>
<li>放弃构造函数与析构函数</li>
</ol>
<h2 id="特征">特征</h2>
<ol class="incremental">
<li><code>go</code> 关键字与协程</li>
<li>推荐采用 erlang 风格的消息传递机制进行通信</li>
<li>强制代码风格</li>
<li>统一的错误处理（多返回，defer 机制等）</li>
<li>非侵入性的接口（鸭子方法，静态编译）</li>
<li>函数式编程，如匿名函数、闭包<a href="#fn1" class="footnote-ref" id="fnref1" role="doc-noteref"><sup>1</sup></a></li>
</ol>
<h1 id="footnotes">Footnotes</h1>
<h1 id="初始-go-语言">初始 go 语言</h1>
<h2 id="go-语言特性">Go 语言特性</h2>
<dl class="incremental">
<dt>GC</dt>
<dd>自动内存管理，有指针而无操作，避免 C 中的野指针问题
</dd>
<dt>更丰富的内置类型</dt>
<dd>如 map, slices
</dd>
<dt>函数多返回值</dt>
<dd>C 需要通过参数修改返回多个值
</dd>
<dt>错误处理</dt>
<dd>defer 及 panic/recover 机制
</dd>
<dt>匿名函数与闭包</dt>
<dd>高阶函数式编程
</dd>
<dt>类型和接口</dt>
<dd>类型组合，非侵入式的接口
</dd>
<dt>并发编程</dt>
<dd>goroutine 以及 channel，CSP（通信顺序进程）
</dd>
<dt>反射</dt>
<dd>动态操作对象，涉及序列化与反序列化
</dd>
<dt>语言交互性</dt>
<dd>cgo 提供与 C 的互操作
</dd>
</dl>
<h2 id="hello-world">Hello World</h2>
<ul class="incremental">
<li>main 包中 main 函数为入口</li>
<li>main 函数无返回，无参数传入（通过 <code>os.Args</code> ）</li>
<li>go run/build 命令运行和编译</li>
<li>go 命令只是一个前端，编译器与链接器为 6g, 6l 等 <a href="#fn2" class="footnote-ref" id="fnref2" role="doc-noteref"><sup>2</sup></a></li>
</ul>
<h2 id="工程管理">工程管理</h2>
<ul class="incremental">
<li>完全用目录结构和包名来推导工程结构和构建顺序（策略而非规则）</li>
<li>包括 src, pkg, bin 三个目录</li>
<li><code>xxx_test.go</code> 是针对 <code>xxx.go</code> 的单元测试文件</li>
<li><code>GOPATH</code> 环境变量为工程根目录</li>
<li><code>go test</code> 执行单元测试</li>
</ul>
<h2 id="其它资料">其它资料</h2>
<ul class="incremental">
<li><a href="https://github.com/wonderfo/wonderfogo/wiki">持续整理的 go 资料</a></li>
</ul>
<h1 id="顺序编程">顺序编程</h1>
<h2 id="变量">变量</h2>
<ul class="incremental">
<li>变量是对一块数据存储空间的命名</li>
<li><code>var</code> 关键字</li>
<li><code>:=</code> 定义及自动类型推导，用于局部变量</li>
<li>支持多重赋值</li>
<li>用 <code>_</code> 来表示匿名变量，通常丢弃该值</li>
</ul>
<h2 id="常量">常量</h2>
<ul class="incremental">
<li>编译期间就已知且不可改变的值</li>
<li>字面常量：无类型，视使用值域而定，保持精确度</li>
<li><code>const</code> 关键字，类似于 <code>var</code> ，可以是无类型的</li>
<li>预定义了 true, false, iota<a href="#fn3" class="footnote-ref" id="fnref3" role="doc-noteref"><sup>3</sup></a> 等变量</li>
</ul>
<h2 id="类型">类型</h2>
<dl class="incremental">
<dt>布尔值</dt>
<dd>bool，值为 <code>true</code> 或 <code>false</code>
</dd>
<dt>整形</dt>
<dd><code>[u]int{8,16,32,64}</code> 以及 <code>int</code>, <code>uint</code>, <code>uintptr</code>
</dd>
<dt>浮点型</dt>
<dd><code>float{32,64}</code>
</dd>
<dt>复数类型</dt>
<dd><code>complex{64,128}</code>
</dd>
<dt>字符串</dt>
<dd>不可修改，字符类型为 <code>rune</code> ，注意与 byte 的区别
</dd>
<dt>字符类型</dt>
<dd>byte vs rune
</dd>
<dt>数组</dt>
<dd><code>[2*N]struct{x,y int 32}</code>, 注意数组是一个 <strong><strong>值类型</strong></strong> ，赋值与传参内容会被复制
</dd>
<dt>切片</dt>
<dd>slices，底层是数组，可动态扩充空间，引用类型。常用方法为 copy,len,cap
</dd>
<dt>map</dt>
<dd><code>map[string] PersonInfo</code> 定义，通过 make 来申请，引用类型
</dd>
</dl>
<h2 id="流程控制">流程控制</h2>
<h3 id="条件语句">条件语句</h3>
<p><code>if ... else</code></p>
<h3 id="选择语句">选择语句</h3>
<ul class="incremental">
<li><code>switch ... case</code></li>
<li>switch 后表达式可选，退化成 <code>if...elseif...else</code> 分支</li>
<li>不需要加 break ，可以加入 fallthrough 跳过跳出</li>
</ul>
<h3 id="循环语句">循环语句</h3>
<p>通过 <code>for</code> 语句实现，有三种方式</p>
<ol class="incremental">
<li>无限循环</li>
<li>C 循环（三段式）</li>
<li>range 迭代</li>
</ol>
<h3 id="跳转语句">跳转语句</h3>
<p><code>goto LABLE</code></p>
<h2 id="函数">函数</h2>
<ul class="incremental">
<li>通过首字母大小写来体现可见性</li>
<li>不定参数 <code>...type</code> ，本质是数组切片</li>
<li>数组展开 <code>slices...</code> ，类似于 lisp apply 展开 list</li>
<li><code>interaface{}</code> 接口可以表示任意类型数据</li>
</ul>
<h2 id="闭包">闭包</h2>
<p>可以包含自由（未绑定）变量的代码段，这些变量不在这个代码块内部或任何全局上下文中定义，而是在定义代码块的环境中定义。</p>
<p>要执行的代码块为自由变量提供绑定的计算环境（作用域）</p>
<h2 id="错误处理">错误处理</h2>
<dl class="incremental">
<dt>error 接口</dt>
<dd>有唯一的方法 Error
</dd>
<dt>defer</dt>
<dd>atexit 回调，保证资源被清理干净
</dd>
<dt>panic/recover</dt>
<dd>defer 会被先执行， recover 位于 defer 中
</dd>
</dl>
<h2 id="示例">示例</h2>
<ul class="incremental">
<li>演示了排序程序，以及命令行的交互实现</li>
<li><code>flag</code> 用于解析参数</li>
<li><code>os.Open</code>, <code>os.Create</code> 以及 <code>File.Close</code>, <code>File.WriteString</code> 操作文件</li>
<li><code>bufio.NewReader</code>, <code>bufio.ReadLine</code> 操作 IO</li>
<li><code>strconv.Atoi</code> 字符串转换</li>
<li><code>time.Now</code> 获取当前时间</li>
</ul>
<h1 id="面向对象编程">面向对象编程</h1>
<h2 id="概述-1">概述</h2>
<ul class="incremental">
<li>Go 没有继承、虚函数、构造/析构函数 ，this 掼</li>
<li>通过接口 (interface) 来盘活整个类型系统</li>
</ul>
<h2 id="类型系统">类型系统</h2>
<h3 id="概述-2">概述</h3>
<p>类型系统是程序语言中一个重要的部分，在 GO 中主要包括以下部分</p>
<ol class="incremental">
<li>基础类型</li>
<li>复合类型：如数组、结构体、指针等</li>
<li>可以指向任意对象的类型（Any 类型）</li>
<li>值语义与引用语义<a href="#fn4" class="footnote-ref" id="fnref4" role="doc-noteref"><sup>4</sup></a></li>
<li>面向对象</li>
<li>接口</li>
</ol>
<h3 id="java-类型系统">Java 类型系统</h3>
<p>以 java 为例，有两套独立的类型系统<a href="#fn5" class="footnote-ref" id="fnref5" role="doc-noteref"><sup>5</sup></a></p>
<ol class="incremental">
<li>值类型：通过装箱才能作为对象，如 int 转换为 Integer 对象</li>
<li>对象类型/引用类型：只允许在堆上创建（共享内存），以 Object 作为类型系统的根</li>
</ol>
<p>只有对象类型才能实现接口</p>
<h3 id="go-语言类型系统">Go 语言类型系统</h3>
<p>Go 语言类型系统有如下特征：</p>
<dl class="incremental">
<dt>大多类型都是值语义</dt>
<dd>意味要想修改变量的值，需要显式的传递指针
</dd>
<dt>可以包含对应的操作方法</dt>
<dd>Reciever
</dd>
<dt>Any 类型</dt>
<dd>即 <code>interface{}</code>
</dd>
</dl>
<p>其值主义表现的非常彻底，包括数组、结构体、指针都基于值语义<a href="#fn6" class="footnote-ref" id="fnref6" role="doc-noteref"><sup>6</sup></a></p>
<p>Go 中有四个引用类型的特别类型：</p>
<ol class="incremental">
<li>slice</li>
<li>map</li>
<li>channel</li>
<li>interface</li>
</ol>
<h2 id="初始化">初始化</h2>
<p>Go 中未显示初始化的变量都会被初始化为默认零值。结构体为例，构造的方法有四种：</p>
<ol class="incremental">
<li><code>new(Rect)</code></li>
<li><code>&amp;Rect{}</code></li>
<li><code>&amp;Rect{0,0,100,200}</code></li>
<li><code>&amp;Rect{width: 100, height: 200}</code></li>
</ol>
<h2 id="匿名组合">匿名组合</h2>
<p>“继承”匿名 struct 的方法，本质是语法糖。其中匿名 struct 中 field 访问获得提升</p>
<h2 id="可见性">可见性</h2>
<ul class="incremental">
<li>通过首字母大小写控制可见性</li>
<li>可见性针对包级别，比 scala 粗旷，但好理解</li>
</ul>
<h2 id="接口">接口</h2>
<p>接口是 go 语言中类型系统的基石</p>
<h3 id="侵入式接口">侵入式接口</h3>
<p>Go 语言之外，接口主要作为不同组件之间的契约关系存在，需要强制声明实现。称为“侵入式”。</p>
<p>侵入式接口有一个邮件个主要问题：</p>
<ol class="incremental">
<li>提供哪些接口</li>
<li>两个类实现了相同的接口，接口放在哪个包好？</li>
</ol>
<h3 id="非侵入式接口">非侵入式接口</h3>
<p>Go 语言中，一个类只要实现了接口要求的所有函数，则自动实现该接口<a href="#fn7" class="footnote-ref" id="fnref7" role="doc-noteref"><sup>7</sup></a>。称为“非侵入式接口”。</p>
<p>其优势在于：</p>
<ol class="incremental">
<li>不再需要绘制类库的继承树图（好事？坏事？）</li>
<li>只需要关心应该提供哪些方法，无须纠结接口如何细分</li>
<li>不需要为实现接口而导包，减少耦合</li>
</ol>
<h2 id="接口赋值">接口赋值</h2>
<p>接口赋值分为两种：</p>
<ol class="incremental">
<li>将对象实例赋值给接口</li>
<li>将一个接口赋值给另一个接口</li>
</ol>
<h3 id="注意">注意</h3>
<p>Go 会根据 <code>func ( a Integer ) Less ( b Integer ) bool</code> 自动生成：</p>
<div class="sourceCode" id="cb1"><pre class="sourceCode go"><code class="sourceCode go"><span id="cb1-1"><a href="#cb1-1"></a><span class="kw">func</span> ( a *Integer ) Less ( b Interger ) book {</span>
<span id="cb1-2"><a href="#cb1-2"></a>    <span class="kw">return</span> (*a).Less(b)</span>
<span id="cb1-3"><a href="#cb1-3"></a>}</span></code></pre></div>
<p>反之则不成立（因为 <code>&amp;a.Add()</code> 改变的只是函数的参数，并不对外部的对象产生影响。</p>
<h2 id="接口查询">接口查询</h2>
<p>用于检查对象是否实现了接口。注意这是在运行期进行的操作，有成本，且可能失败</p>
<div class="sourceCode" id="cb2"><pre class="sourceCode go"><code class="sourceCode go"><span id="cb2-1"><a href="#cb2-1"></a>file, ok := obj.(*File)</span></code></pre></div>
<p>接口查询的主要用途是：</p>
<ol class="incremental">
<li>查询接口</li>
<li>查询具体类型</li>
</ol>
<h3 id="类型查询">类型查询</h3>
<p>通过 <code>v.(type)</code> 语法来查询，配合 <code>switch</code> 语法。另外也可以通过反射进行类型查询 ，详见 <code>reflect.TypeOf</code> 方法</p>
<h2 id="接口组合">接口组合</h2>
<p>与类型匿名组合类似，可看作其一种特殊用法。</p>
<p>用于整合不同接口，形成新的接口。</p>
<h2 id="any-类型">Any 类型</h2>
<p>go 语言中任何对象实例都满足 <code>interface{}</code> 接口。</p>
<p>对于 Any 类型，刚开始对其一无所知，但可以通过接口查询和类型查询了解它（自省特性？）</p>
<h1 id="并发编程"><span class="todo TODO">TODO</span> 并发编程</h1>
<h1 id="开发工具">开发工具</h1>
<ul class="incremental">
<li><code>github.com/nfs/gocode</code> 提供代码补全功能</li>
<li>由于多线程和多进程的引入 ，可视化调试手段功能有限，不如直接 <code>fmt.Println</code></li>
</ul>
<section class="footnotes" role="doc-endnotes">
<hr />
<ol>
<li id="fn1" role="doc-endnote"><p>闭包在函数式编程中是一个重要想对概念，C++ 式的面向对象编程中把一组函数绑定到特定的数据类型上，而闭包可以说是把一组数据绑定到特定的函数上。<a href="#fnref1" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
<li id="fn2" role="doc-endnote"><p>貌似 plan9 中的编译器也是如此。在 1.8 版本的 bin 目录下没有看到 6g, 6l 等文件？<a href="#fnref2" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
<li id="fn3" role="doc-endnote"><p>编译时生成，每次自动加 1。用于生成枚举，多次调用时可以只写第一个，后续省略<a href="#fnref3" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
<li id="fn4" role="doc-endnote"><p>在 C 语言中函数传参方式不同，决定函数是否能够修改外部变量内容<a href="#fnref4" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
<li id="fn5" role="doc-endnote"><p>可以看出 java 不是完整的面向对象语言，在 ruby 等中强制要求所有类型都是对象<a href="#fnref5" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
<li id="fn6" role="doc-endnote"><p>C 语言中数组基于引用，但结构体中的数组基于值<a href="#fnref6" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
<li id="fn7" role="doc-endnote"><p>类似于 python 中的 duck type，但由于 go 是编译语言，在使用时强制转换和检查，能保证更好的可用性和性能<a href="#fnref7" class="footnote-back" role="doc-backlink">↩︎</a></p></li>
</ol>
</section>

      </div>
    </section>
  </body>
</html>
